In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
from numpy.random import randn

In [5]:
np.random.seed(101) #pseudo random number generator

In [6]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'Y', 'Z', 'X'])

In [7]:
df

          W         Y         Z         X
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(df['W'])

pandas.core.series.Series

In [10]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [11]:
#Adding new column to the the df

In [12]:
df

          W         Y         Z         X
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df#will get the original df since i didn't specify it

          W         Y         Z         X
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df.drop('W', axis=1, inplace=True)

In [15]:
df

          Y         Z         X
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [16]:
df.drop('D') #drop rows BY default axis=0, there is no need to specify it but it do matter

          Y         Z         X
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
E  1.978757  2.605967  0.683509

In [17]:
df

          Y         Z         X
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [24]:
df.loc['B'] #ACCESSING ROWS

Y   -0.319318
Z   -0.848077
X    0.605965
Name: B, dtype: float64

In [25]:
df.loc[['B', 'C']]

          Y         Z         X
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001

In [23]:
df.iloc[[2,3]] #accessing data in row index no matter how labelled they are

          Y         Z         X
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057

In [20]:
#SUBSETS

In [74]:
df.loc['B', 'Y'] #getting the value that fall in the cell mentioned

-0.31931804459303326

In [75]:
df.loc[['A', 'C'], ['Y', 'X']] #getting row ac and columns yx

          Y         X
A  0.628133  0.503826
C  0.740122 -0.589001

In [76]:
df

          Y         Z         X
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [77]:
df.drop(['Y', 'Z'], axis=1) #dropping two columns

          X
A  0.503826
B  0.605965
C -0.589001
D  0.955057
E  0.683509

In [78]:
df

          Y         Z         X
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [79]:
#conditional filtering

In [81]:
df[df['Y']>0]#ONLY SHOWING VALUES WHERE Y IS POSITIVE

          Y         Z         X
A  0.628133  0.907969  0.503826
C  0.740122  0.528813 -0.589001
E  1.978757  2.605967  0.683509

In [83]:
df[df['Z'] < 0] #ONLY SHOWING VALUES WHERE Z IS NEGATIVE

          Y         Z         X
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057

In [84]:
df

          Y         Z         X
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [86]:
df[df['X'] > 0]['Y'] #ONLY VALUES OF Y WHEN X IS NEGATIVE

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: Y, dtype: float64

In [87]:
df

          Y         Z         X
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [91]:
df[df['X'] > 0][['Y', 'Z']] #ONLY VALUES OF Y AND Z WHEN X IS NEGATIVE

          Y         Z
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [92]:
df

          Y         Z         X
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [100]:
df[(df['Y'] > 1) & (df['Z'] > 0)] #DON'T USE NORMAL PY AND OPERATOR! use ampasand operator

          Y         Z         X
E  1.978757  2.605967  0.683509

In [101]:
True and False

False

In [102]:
True and True

True

In [103]:
False and False

False

In [104]:
df[(df['Y'] > 1) | (df['Z'] > 0)] #DON'T USE NORMAL PY OR OPERATOR! use pipe operator

          Y         Z         X
A  0.628133  0.907969  0.503826
C  0.740122  0.528813 -0.589001
E  1.978757  2.605967  0.683509